# Gravity Assist

There are 4 *sulci* (a sulcus is a subparallel furrow or ridge), collectively called *the Tiger Stripes*, on the surface of Enceladus that make up the sole source of plumes from this moon. Named after places in *A thousand and one arabian nights*, they are called

- Cairo
- Baghdad
- Alexandria
- Damascus

Each are about 130 km long by 2 km wide. Source of the plume is suspected to originate from the moon's **porous** core. Area of interest is 1500 km above the surface. Since the sulci cover almost 150 km, and Enceladus has a diameter of 504 km, if we think it came from the core this translates to an angle of

$$
\theta = 150 / (504 * \pi) / 360\deg = 34
$$

Extending from the core, through the surface, out 4000 km to space (so that our 1500 km area of interest is in the centre), that's the analytical window.

Find when Cassini when it enters and leaves this cone of interest.

Assumptions:

- each nadir centered on the south pole where the Tiger Stripes are; analytics team will adjust for it themselves
- Cassini flys orthogonal to the surface of the southpole; it being a straight line is probably fair given the speed of the flybys, but *orthogonal* requires some imagination right? Actually it may be a consequence of the first assumption, if we also assume a straight line

In [1]:
%load_ext sql

In [2]:
import os
from dotenv import load_dotenv

In [3]:
load_dotenv("../.env")
user = os.environ.get('POSTGRES_USER')
pw = os.environ.get('POSTGRES_PASSWORD')
db_name = os.environ.get('POSTGRES_DB')
host = 'localhost'
port = 5432
conn_str = f'postgresql://{user}:{pw}@{host}:{port}/{db_name}'

In [4]:
%sql $conn_str

In [6]:
%%sql
select * from flybys;

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.

[(datetime.datetime(2005, 2, 17, 3, 30, 12, 119000), Decimal('1272.075'), 'E-0', None, None, 1),
 (datetime.datetime(2005, 3, 9, 9, 8, 3, 472500), Decimal('500.370'), 'E-1', None, None, 2),
 (datetime.datetime(2005, 7, 14, 19, 55, 22, 330000), Decimal('168.012'), 'E-2', None, None, 3),
 (datetime.datetime(2008, 3, 12, 19, 6, 11, 509000), Decimal('50.292'), 'E-3', None, None, 4),
 (datetime.datetime(2008, 8, 11, 21, 6, 18, 574000), Decimal('53.353'), 'E-4', None, None, 5),
 (datetime.datetime(2008, 10, 9, 19, 6, 39, 724000), Decimal('28.576'), 'E-5', None, None, 6),
 (datetime.datetime(2008, 10, 31, 17, 14, 51, 429000), Decimal('173.044'), 'E-6', None, None, 7),
 (datetime.datetime(2009, 11, 2, 7, 41, 57, 707000), Decimal('98.901'), 'E-7', None, None, 8),
 (datetime.datetime(2009, 11, 21, 2, 9, 56, 371000), Decimal('1596.561'), 'E-8', None, None, 9),
 (datetime.datetime(2010, 4, 28, 0, 0, 1, 88000), Decimal('3771.195'), 'E-9', None, None, 10),
 (datetime.datetime(2010, 5, 18, 6, 4, 40, 301000), Decimal('437.292'), 'E-10', None, None, 11),
 (datetime.datetime(2010, 8, 13, 22, 30, 51, 975000), Decimal('2555.180'), 'E-11', None, None, 12),
 (datetime.datetime(2010, 11, 30, 11, 53, 59, 49000), Decimal('45.699'), 'E-12', None, None, 13),
 (datetime.datetime(2010, 12, 21, 1, 8, 27, 146000), Decimal('48.324'), 'E-13', None, None, 14),
 (datetime.datetime(2011, 10, 1, 13, 52, 25, 698000), Decimal('98.898'), 'E-14', None, None, 15),
 (datetime.datetime(2011, 10, 19, 9, 22, 11, 224500), Decimal('1230.674'), 'E-15', None, None, 16),
 (datetime.datetime(2011, 11, 6, 4, 58, 53, 480500), Decimal('496.603'), 'E-16', None, None, 17),
 (datetime.datetime(2012, 3, 27, 18, 30, 8, 975000), Decimal('74.165'), 'E-17', None, None, 18),
 (datetime.datetime(2012, 4, 14, 14, 1, 37, 811000), Decimal('74.100'), 'E-18', None, None, 19),
 (datetime.datetime(2012, 5, 2, 9, 31, 28, 949000), Decimal('73.134'), 'E-19', None, None, 20),
 (datetime.datetime(2015, 10, 14, 10, 41, 28, 976500), Decimal('1844.230'), 'E-20', None, None, 21),
 (datetime.datetime(2015, 10, 28, 15, 22, 41, 550000), Decimal('49.010'), 'E-21', None, None, 22),
 (datetime.datetime(2015, 12, 19, 17, 49, 16, 113500), Decimal('5000.200'), 'E-22', None, None, 23)]

In [14]:
%%sql
-- set the table
ALTER TABLE public.flybys
ADD speed_kms numeric(10,3),
ADD target_altitude numeric(10,3),
ADD transit_distance numeric(10,3);

 * postgresql://postgres:***@localhost:5432/enceladus
Done.

[]

Calculate our triangle; first confirm the numbers in a SELECT query

In [15]:
%%sql
-- sin defaults to radians; sind for degrees
select
    name,
    altitude,
    (altitude + 252) / sind(73) - 252 as target_altitude,
    (altitude + 252) / sind(73) * sind(17) * 2 as transit_distance
from flybys;

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.

[('E-0', Decimal('1272.075'), 1341.7126637681502, 931.9129766882158),
 ('E-1', Decimal('500.370'), 534.7471068282356, 460.04518561810477),
 ('E-2', Decimal('168.012'), 187.20308602568002, 256.8211099616298),
 ('E-3', Decimal('50.292'), 64.10425245201293, 184.83987831900276),
 ('E-4', Decimal('53.353'), 67.30511491862012, 186.7115615508927),
 ('E-5', Decimal('28.576'), 41.39601026813807, 171.56138336189025),
 ('E-6', Decimal('173.044'), 192.46500694432336, 259.89798353982974),
 ('E-7', Decimal('98.901'), 114.93428304309674, 214.56240370905084),
 ('E-8', Decimal('1596.561'), 1681.024999063639, 1130.3236284958057),
 ('E-9', Decimal('3771.195'), 3955.021846240312, 2460.0282979821513),
 ('E-10', Decimal('437.292'), 468.78696221253927, 421.475425768006),
 ('E-11', Decimal('2555.180'), 2683.444984975592, 1716.4821087542448),
 ('E-12', Decimal('45.699'), 59.30139021446752, 182.03143627912354),
 ('E-13', Decimal('48.324'), 62.04633107524626, 183.63652235678148),
 ('E-14', Decimal('98.898'), 114.93114596782732, 214.5605693249621),
 ('E-15', Decimal('1230.674'), 1298.4199793578257, 906.5978648020758),
 ('E-16', Decimal('496.603'), 530.8079859815484, 457.7418106639952),
 ('E-17', Decimal('74.165'), 89.06805175463069, 199.437295435928),
 ('E-18', Decimal('74.100'), 89.00008179045898, 199.39755044733835),
 ('E-19', Decimal('73.134'), 87.9899435536924, 198.80687877076022),
 ('E-20', Decimal('1844.230'), 1940.0104307010542, 1281.7636527881757),
 ('E-21', Decimal('49.010'), 62.76367562019641, 184.05598485174275),
 ('E-22', Decimal('5000.200'), 5240.182243421799, 3211.5173703143532)]

Update our flybys table

In [16]:
%%sql
-- hypotenuse
UPDATE flybys
SET target_altitude = (altitude + 252) / sind(73) - 252;
-- transit dist
UPDATE flybys
SET transit_distance = (altitude + 252) / sind(73) * sind(17) * 2;
-- visual check
SELECT * FROM flybys LIMIT 5;

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.
23 rows affected.
5 rows affected.

[(datetime.datetime(2005, 2, 17, 3, 30, 12, 119000), Decimal('1272.075'), 'E-0', None, None, 1, None, Decimal('1341.713'), Decimal('931.913')),
 (datetime.datetime(2005, 3, 9, 9, 8, 3, 472500), Decimal('500.370'), 'E-1', None, None, 2, None, Decimal('534.747'), Decimal('460.045')),
 (datetime.datetime(2005, 7, 14, 19, 55, 22, 330000), Decimal('168.012'), 'E-2', None, None, 3, None, Decimal('187.203'), Decimal('256.821')),
 (datetime.datetime(2008, 3, 12, 19, 6, 11, 509000), Decimal('50.292'), 'E-3', None, None, 4, None, Decimal('64.104'), Decimal('184.840')),
 (datetime.datetime(2008, 8, 11, 21, 6, 18, 574000), Decimal('53.353'), 'E-4', None, None, 5, None, Decimal('67.305'), Decimal('186.712'))]

In [22]:
%%sql
select * from pg_matviews;

 * postgresql://postgres:***@localhost:5432/enceladus
2 rows affected.

[('public', 'flyby_altitudes', 'postgres', None, False, True, " SELECT (inms.sclk)::timestamp without time zone AS time_stamp,\n    date_part('year'::text, (inms.sclk)::timestamp without time zone) AS year,\n     ... (66 characters truncated) ... AS week,\n    (inms.alt_t)::numeric(10,3) AS altitude\n   FROM import.inms\n  WHERE ((inms.target = 'ENCELADUS'::text) AND (inms.alt_t IS NOT NULL));"),
 ('public', 'enceladus_events', 'postgres', None, True, True, " SELECT events.id,\n    events.title,\n    events.description,\n    events.time_stamp,\n    (events.time_stamp)::date AS date,\n    event_types.descr ... (91 characters truncated) ... n   FROM (events\n     JOIN event_types ON ((event_types.id = events.event_type_id)))\n  WHERE (events.target_id = 28)\n  ORDER BY events.time_stamp;")]

In [13]:
%%sql
select column_name, data_type
from information_schema.columns
where table_name = 'impacts';

 * postgresql://postgres:***@localhost:5432/enceladus
11 rows affected.

[('id', 'integer'),
 ('time_stamp', 'timestamp without time zone'),
 ('impact_date', 'date'),
 ('counter_number', 'integer'),
 ('sun_distance_au', 'numeric'),
 ('saturn_distance_rads', 'numeric'),
 ('x_velocity', 'numeric'),
 ('y_velocity', 'numeric'),
 ('z_velocity', 'numeric'),
 ('particle_charge', 'numeric'),
 ('particle_mass', 'numeric')]